<script lang="ts">
import {defineComponent} from 'vue'

export default defineComponent({
  name: "ServiceView"
})
</script>

<template>
  <div class="home">
    <div class="contain flex">
      <div class="contain-text">
        <h1 style="text-align: center">用户注册和服务协议</h1>
        <span style="text-align: left;color:#e1e1e1;">
        <p>欢迎您使用RVC平台服务！</p>
        <p>本协议系由您（或称“用户”）与（或称“我们”）之间就RVC平台（以下或简称“平台”）服务而签订。</p>
        <p>在使用平台服务之前，请您务必审慎阅读、充分理解本协议(如果您未满16周岁，或已满16周岁未满18周岁且不能以自己的劳动收入作为主要收入来源的，请在法定监护人的陪同下阅读本协议）各项条款，特别是限制或免除责任条款、隐私保护
        政策、帐号规则、法律适用和争议解决条款（包括管辖条款），以及其它以加粗加黑和/或加下划线等显示形式提示您注意的重要条款，请务必重点查阅。</p>
        <p>若您不同意本协议，则您有充分且完全的权利退出使用平台服务（但这并不妨碍您浏览平台中的信息），您通过网络页面点击注册和/或实际使用平台服务的行为即视为您已阅读、理解并同意接受本协议。如果您对本协议有任何的疑问、投诉、意
        见和建议，欢迎您通过本协议所附联系方式与我们沟通反馈，我们十分乐意为您解答。</p>
        <h2>1.基础约定</h2>
        <h3>1.1.协议范围：</h3>
        <p>考虑到互联网服务以及产品频繁迭代更新等行业特点，为了更全面的界定您与平台之间的权利义务，本协议包括我们根据法律法规规定以及本协议制
        定的其他政策、规则、公告声明等（除非特有所指，合称为“本协议”），您也应当加以遵守。</p>
        <h3>1.2.服务范围：</h3>
        <p>我们可能通过不断丰富的功能界面向您提供本协议项下的平台服务，包括但不限于移动应用程序（“APP”）、PC端网站、小程序以及其他形式。具体
        以我们实时发布的服务功能界面范围为准。</p>
        <h3>1.3.修改与更新：</h3>
        <p>我们有权遵照法律法规规定，在必要时修改本协议（包括适时制
定并发布其他政策、规则、公告声明），更新后的协议条款将代替原来的协议并在
法律规定的期限届满后正式生效，您可以在相关服务页面查阅最新版本的协议条款。
本协议修改后，如果您继续使用平台服务的，即视为您已接受修改后的协议。如果
您不接受修改后的协议，则您有权利停止使用平台服务。</p>
        <h3>1.4.非商业使用许可：</h3>
        <p>平台授予用户一项个人的、不可转让及免费使用（除本协议另有声明外）的许
可，以供您使用平台服务，用户可以以非商业目的使用。</p>
        <h2>2.平台服务内容</h2>
        <h3>2.1.平台服务:</h3>
        <p>你可以通过下载、开启、登录、浏览、购买、定制平台的任一功能。</p>
        <h3>2.2.付费服务：</h3>
        <p>平台提供的部分软件工具为收费的网络服务，用户使用收费网络服务需要向平
台支付一定的费用。对于收费的网络服务，平台会在您使用之前给予您明确的提示，
只有您根据提示确认其愿意支付相关费用，您才能使用该等收费网络服务。如您拒
绝支付相关费用，则平台有权不向您提供该等收费网络服务。</p>
        <h3>2.3.投诉机制：</h3>
        <p>平台建立便捷有效的投诉举报机制并将尽最大努力及时受理并处理您的投诉举
报，同时，当您在平台发生购物争议时，若您同意平台争议解决规则，则我们亦将
协助您处理您的争议。您同意平台有权作为独立的第三方，根据平台所了解到的争
议事实并依据平台争议解决规则，以普通人的注意义务程度，独立的作出调处决定。
如您对调处决定不满意，您仍有权采取其他法定争议处理途径解决争议，但通过其
他争议处理途径未取得终局决定前，您同意先履行调处决定。</p>
        <h3>2.4.第三方服务：</h3>
        <p>为服务达成以及提升用户体验等目的，平台亦将为您提供更为友好完善的平台
服务，并优化和引入第三方服务。由此发生的法律关系是由您和该等第三方服务商
之间形成，和平台无关。</p>
        <h3>2.5.其他：</h3>
        <p>您同意并知悉，平台中的具体内容、功能和形式由平台根据实际情况按实际可
见的状态提供，我们有权自行确定平台服务的具体内容、功能和形式（例如，我们
可能仅在特定的国家或地区以特定的语言提供），有权自行决定增加、变更、中断
和停止平台具体的内容、功能和形式。具体以平台实时呈现的服务内容、功能和形
式为准。</p>
        <h2>3.用户帐号规则</h2>
        <h3>3.1.用户信息：</h3>
        <p>您在注册或使用平台服务时可能需要提供一些必要的信息。您须保证所填写及
所提供的资料真实、准确、完整，否则可能无法使用平台服务，或在使用过程中受
到限制，甚至影响您是否能够使用平台特定功能。对于因您提供的信息不真实、不
准确或不完整导致的责任和损失由您承担。</p>
        <h3>3.2.信息变更：</h3>
        <p>平台有权根据您所提供资料的真实性、准确性、完整性以及是否符合平台服务
规定的其他条件，决定是否为您提供服务。您在使用平台服务过程中，所提供的信
息发生变动，应及时进行变更。</p>
        <h3>3.3.用户账号：</h3>
        <p>您注册成功后，我们将为您配置帐号，该帐号之所有权归平台所有，用户在本
协议有效期内仅享有使用权。未经平台同意，用户的帐号仅供用户本人使用，帐号
信息和权限不得以转让、赠与、借用、售卖、授权或租用等方式许可给第三方使用
或和第三方共同控制、使用。</p>
        <h3>3.4.关联账号：</h3>
        <p>您知悉并理解，如不同帐号绑定或关联同一手机号、同一支付账户、同一身份
证信息、同一设备号或相同收货信息，所述不同帐号将可能被视为关联帐号（即同
一用户），在此情况下，我们有权进行合并或强制注销相关帐号。</p>
        <h3>3.5.账号注销：</h3>
        <p>如果您需要注销您的帐号，您有权通过平台公布的方式、程序进行，我们将在
核实您的身份并清理帐号资产（例如已充值或已获得的虚拟资产等）及纠纷争议后，
为您提供帐号注销服务。在注销帐号之后本协议即终止，我们将停止为您提供任何
服务。当然，我们也保留权利在您的帐号符合回收的如下情况下，直接回收并注销
您的帐号并停止服务：<br>（1）未通过实名认证；<br>（2）连续12个月未曾登陆、使用
平台服务；<br>（3）其它情况。</p>
        <h3>3.6.第三方平台：</h3>
        <p>用户一经注册，即可能可以在平台及我们关联公司运营的其它产品，或者合作
伙伴等第三方平台中通行使用。在使用平台服务帐号登录并使用其他产品或服务时，
除遵守本协议约定外，还应遵守该等产品的服务协议的约定。平台服务和其他产品
对可能出现的纠纷在法律规定和约定的范围内各自承担责任。</p>
        <h3>3.7.更多服务：</h3>
        <p>为客户体验及功能服务考虑，您在使用不同服务时被要求填写的信息内容可能
不完全一致，因此，在使用更高级别服务时，为了给您提供更好的服务及为了您的
登录帐号安全，可能需要您补充完整信息后方可使用。</p>
        <h3>3.8.账号安全：</h3>
        <p>您有责任自行负责保管帐号的用户名和密码等信息，否则因该等事项引发的法
律责任由用户自行承担。凡使用平台服务登录帐号和登录凭证的行为，平台服务视
为您本人的操作，操作所产生的电子信息记录均为平台服务用户行为的有效凭据。</p>
        <h2>4.用户行为规范</h2>
        <h3>4.1.接受协议：</h3>
        <p>您保证合理地使用平台服务，并接受本协议和我们适时制定并发布的其他政策、规则、公告声明。</p>
        <h3>4.2.行为禁止：</h3>
        <p>您可在本协议约定的范围内使用平台及服务，您不得利用平台从事以下行为：<br>
        （1）超出授权或恶意使用平台服务；<br>
        （2）利用平台发表、传送、传播、储存危害国家安全、国家统一、社会稳定的内
        容，或侮辱诽谤、色情、暴力、引起他人不安及任何违反国家法律法规政策的内容，
        或者设置含有上述内容的网名、角色名，发布、传送、传播违法广告信息、营销信
        息及垃圾信息等；<br>
        （3）利用平台侵害他人知识产权、肖像权、隐私权、名誉权、个人信息等合法权
        利或权益；<br>
        （4）恶意虚构或协助虚构事实、评价等信息或数据；<br>
        （5）进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据
        或进入未经许可的服务器/账户；未经允许进入公众计算机网络或者他人计算机系
        统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本“软件”系
        统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏本“软件”系统
        或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务
        的行为；伪造TCP/IP数据包名称或部分名称；利用平台及服务上传任何病毒、木
        马，或者蠕虫等危害网络健康的内容；<br>
        （6）对平台进行反向工程、反向编译或反向汇编或以其它方式企图发现平台的源
        代码和算法，未经许可修改、禁用软件的任何功能或创建基于软件的衍生作品。去
        除平台或文档上的任何所有权声明或标签，或将其他软件与平台合并；<br>
        （7）进行任何破坏我们提供服务公平性或者其他影响应用正常秩序的行为，如主
        动或被动刷分、合伙作弊、使用外挂或者其他的作弊软件、利用BUG（又叫“漏洞”
        或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作
        弊软件、BUG公之于众；<br>
        （8）从事其他法律法规、政策及公序良俗、社会公德禁止的行为以及侵犯其他个
        人、公司、社会团体、组织的合法权益的行为。<br>
        如您或您的作品违反上述任一禁止行为的，我们有权采取删除、屏蔽、冻结您的作
        品和您的账号的权利，我们无需得到您的同意，并且不予任何赔偿。</p>
        <h2>5.个人信息保护与隐私政策</h2>
        <h3>5.1.用户隐私：</h3>
        <p>尊重用户隐私并保护您的个人信息安全是我们的一贯态度，平台将会采取合理
的措施保护您的个人信息与隐私。我们承诺，除非获得用户同意，平台不会收集、
使用其提供服务所必需以外的用户个人信息或者将信息用于提供服务之外的目的。</p>
        <h3>5.2.安全保护：</h3>
        <p>我们将运用各种安全技术和程序建立完善的管理制度来保护您的个
人信息及隐私安全，以免遭受未经授权的访问、使用或披露。</p>
        <h3>5.3.信息使用与披露：</h3>
        <p>我们有权在遵守法律法规的前提下，以明示的方式获取、使
用、储存和分享您的个人信息。我们不会在未经您授权时，公开、编辑或透露您的
个人信息及您保存在我们的非公开内容。您同意并保证：平台有权根据我们制定的
个人信息保护规则收集使用您的相关信息。</p>
        <h3>5.4.收集用户行为：</h3>
        <p>您同意，我们有权通过cookie等技术收集您的使用、行为信息，并在经过数
据脱敏使之不再指向、关联到您个人的身份信息时，自由使用脱敏后的纯商业数据。
当然，您也可根据自己的偏好删除Cookie，但如果您这么做，则需要在每一次访
问我们的网站时亲自更改用户设置。目前删除Cookie的一般路径是浏览器：“设
置-清除数据”，或者将手机系统还原/清除。</p>
        <h3>5.5.隐私政策：</h3>
        <p>在遵守本协议项下特别约定的个人信息保护与隐私政策外，我们希望您认真并
完整阅读我们特别针对平台而制定并适时发布的《隐私权政策》，这将更有助于保
障您的个人信息。</p>
        <h2>6.信息或广告推送</h2>
        <h3>6.1.第三方广告：</h3>
        <p>您同意在接受我们提供服务的同时，允许我们在遵守法律法规的前提下自行或
由第三方广告商向您发送、展示广告、推广或宣传信息（包括商业与非商业信息）。
如您对发送、推荐的广告或信息不感兴趣，您可以基于我们提供的相关技术选项，
控制系统向您展示或不展示/减少展示相关类型的广告或信息。</p>
        <h2>7.知识产权等权益</h2>
        <h3>7.1.平台整体内容知识产权：</h3>
        <p>我们对平台中所包含的受知识产权或其他法律保护的资料享有相应的权利；除
依法由用户享有著作权的内容之外，平台的整体内容的知识产权归我们或关联公司
所有。</p>
        <h3>7.2.用户发表内容知识产权：</h3>
        <p>您在使用我们服务时利用平台及服务所发表上传的文字、图片、视频、软件以
        及表演等原创信息的知识产权归您所有（或由第三方内容提供方和您另行约定），
        但是基于平台运营的需求，您确认您对该等信息的发表、上传行为视同为对我们授
        权知识产权的使用、复制、传播等权利。</p>
        <h3>7.3.数据权益：</h3>
        <p>基于对数据的合法加工而获得的具有竞争性的数据权益，除法律法规另有规定外，我们享有独立的使用权益而无须获得您的同意。</p>
        <h3>7.4.保护措施：</h3>
        <p>关于信息内容的投诉或举报。若您在使用平台过程中，不慎受到合法权益的侵
        犯，您有权通知我们采取必要措施进行处置。若您在使用平台过程中，发现存在违
        法违规或违反本服务相关规则的情况，您也有权向我们发起举报，我们亦会及时采
        取必要措施（删除、屏蔽、断开链接或限制使用功能等）进行处置。</p>
        <h3>7.5.内容维权授权：</h3>
        <p>在法律法规允许的范围内，您同意并授权我们就侵犯您合法权
        益的行为（包括但不限于私自复制、使用、编辑、抄袭等行为）采取任何形式的法
        律行动，包括但不限于投诉、诉讼等必要的维权措施。</p>
        <h2>8.免责声明</h2>
        <h3>8.1.第三方信息：</h3>
        <p>我们对于您自平台而获得的所有他人、第三方的信息、内容或者广告宣传等任
        何资讯（以下统称“信息”），除法律明确规定外，不保证真实、准确和完整性。
        如果任何单位或者个人通过上述“信息”而进行任何行为，您须自行甄别真伪和谨
        慎预防风险。您在接受平台及服务时，有可能会接触到令人不快、不适当或令人厌
        恶的内容，在任何情况下，我们均不对任何此等内容承担任何责任。无论何种原因，
        我们不对任何非与我们直接发生的交易或行为承担任何直接、间接、附带或衍生的
        损失和责任。</p>
        <h3>8.2.不可抗力：</h3>
        <p>鉴于互联网服务的特殊性，您理解并同意我们在以下情况下无需对您所遭受的损失（包括但不限于财产、收益、数据资料等方面的损失或其它无形损失）承担责任：<br>
        （1）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致平台及服务障碍不能正常运作；<br>
        （2）由于计算机病毒、木马、其他恶意程序、黑客攻击、电信部门及网络运营公司技术调整或故障、系统维护等意外原因而造成平台及服务中断或延迟。</p>
        <h2>9.违约责任</h2>
        <h3>9.1.违法违规：</h3>
        <p>如果我们发现、收到他人举报或投诉您违反本协议约定或违反法律法规和国家有关规定的，我们有权采取警示、冻结、终止/中止/限制使用帐号等功能、解除或终止本协议，或提出损害赔偿等措施。</p>
        <h3>9.2.损失追偿：</h3>
        <p>若您的行为给我们造成损失的（包括但不限于直接损失、名誉损失、第三方的罚款、索赔等），我们有权全额向您追偿，如您在平台中有保证金、虚拟货币等财产或优惠券等虚拟权益的，我们有权冻结。</p>
        <h3>9.3.责任追究：</h3>
        <p>本协议终止后，除法律有明确规定外，平台无义务向您或您指定的第三方披露您账户中的任何信息。本协议终止后，平台仍享有下列权利：根据法律规定，继续保存您留存于平台的的各类信息；对于您过往的违约行为，平台仍可依据本协议向您追究违约责任。</p>
        <h2>10.法律适用与管辖</h2>
        <h3>10.1.法律适用：</h3>
        <p>本协议的订立、执行、解释及争议的解决均适用中华人民共和国法律。</p>
        <h3>10.2.争议解决：</h3>
        <p>如双方就平台服务协议内容或其履行发生任何争议，双方应尽力友好协商解
决；协商不成时，任何一方均可向协议签订地，即法院提起诉讼。</p>
        <h2>11.如何联系我们</h2>
        <p>如果您有任何的疑问、投诉、意见和建议，欢迎您与我们沟通反馈。我们的联系方式见下：<br>
        客服邮箱：2898473114@qq.com</p>
      </span>
      </div>
    </div>
  </div>
</template>

<style scoped>
.home{
  width:100%;
  height:100%;
  background-color: rgb(66, 66, 68);
}
.contain{
  position: relative;
  overflow: scroll;
  left:9%;
  width:82%;
  height: 100vh;
  background-color:  rgb(66, 66, 68);
  box-shadow: 16px 16px 32px #363638,
  -16px -16px 32px #4e4e50;
}
.contain-text{
  position: relative;
  bottom: 60px;
  overflow: scroll;
  text-align: left;
  width:90%;
  height:80%;
  color: #e0e0e0;
}
h1{
  color:#e1e1e1;
}
h2{
  margin-top: 20px;
  color:#e1e1e1;
}
h3{
  margin-top: 15px;
  color:#e1e1e1;
}
h4{
  margin-top: 5px;
  color:#e1e1e1;
}
p{
  margin-top: 10px;
  color:#e1e1e1;
  font-family: 宋体, serif;
}
</style>