<script lang="ts">
import {defineComponent} from 'vue'

export default defineComponent({
  name: "ServiceView"
})
</script>

<template>
  <div class="home">
    <div class="contain flex">
      <div class="contain-text">
        <h1>服务条款</h1>
        <h2>同意</h2>
        <p>使用我们的应用程序进行除访问此“服务条款”页面的链接或访问我们网站除我们的主页和本“条款”页面以外的任何页面以外的任何操作，即表示您同意这些使用条款。如果您不同意，请不要使用我们的网站。
          您使用我们的网站进行任何访问/查看（即上传、下载、评论等）以外的任何事情，不仅构成您的同意，还构成您的电子签名，这意味着您受这些条款的合同约束。</p>
        <h2>内容</h2>
        <p>您对您在我们网站上发布、发布、展示或以其他方式提供的内容，以及因您使用服务（包括我们的内容或其他用户的内容）或您根据您的帐户授权的个人或实体的使用而导致的任何作为或不作为负全部责任。</p>
        <p>您声明并保证，您对您在我们网站上发布或以其他方式提供的内容拥有所有权、控制权和责任，或以其他方式有权这样做。您的内容不得具有误导性或非法性，不得违反任何这些条款、适用的法律和法规，或侵犯或盗用任何个人或实体的任何权利。如果我们对您的内容有疑虑，我们可以随时自行决定删除您的内容。</p>
        <p>通过在我们的网站上发布您的内容或以其他方式提供您的内容，您承认并同意：</p>
        <h4>您拥有您创建的内容，但您授予我们全球性的、免版税的、非排他性的许可，以使用、展示、发布、复制、分发和制作此类内容的衍生作品，以提供服务，以及这些条款和我们的隐私政策允许的其他情况。</h4>
        <h4>您的内容将被其他人查看，因此：
          <p>如果您将您的内容设置为公开，则您授予每个用户永久的、不可撤销的、全球性的、免版税的、非排他性的许可，以通过我们的服务和功能使用、展示、发布、复制、分发您的内容并制作您的内容的衍生作品。</p>
          <p>如果您将您的内容设置为私密，我们将使用合理和适当的措施来保护您的内容保密并防止未经授权的访问或披露。但是，我们可能会根据这些条款和我们的隐私政策访问或共享您的私人信息。
          </p>
        </h4>
        <h4>当内容包含合理且惯常的许可声明（例如开源许可）时，此类内容在进一步访问、分发或使用时应遵守该许可的条款。任何一方均不得删除对任何此类许可的引用。
        </h4>
        <p>您同意，您从我们或其他用户处下载、访问或使用的任何内容均由您自行承担风险，并受这些条款和/或此类内容随附的条款的约束。</p>
        <h2>内容规则</h2>
        <p>这些规则适用于在RVC上发布的所有内容。版主在执行社区规则时会考虑上下文和意图。版主可自行决定标记或删除内容或用户。</p>
        <h3>成人内容定义：</h3>
        <p>包含裸露、性情境、挑衅/暴露的着装、血腥、死亡或其他成人主题的内容。</p>
        <h3>内容移除标准：</h3>
        <h4>在成人环境中描绘或意图描绘真实个人或未成年人（未满 18 周岁）的内容。</h4>
        <h4>宣扬非法或暴力活动的内容，包括但不限于：
          虐待和剥削儿童
          强奸和家庭虐待
          需要许可证/执照的非法物质或产品销售（例如药品、麻醉品、宠物、枪支）
          欺诈、欺骗或虚假冒充
          残酷的战斗、血腥的伤害或人员死亡</h4>
        <h4>基于但不限于以下原因的不尊重、冒犯或宣扬仇恨言论、歧视或骚扰的内容：
          宗教或宗教信仰
          国籍、民族或种族
          性别或性取向
          残疾或医疗状况</h4>
        <h4>内容复制和虚假冒充。
          被错误地标记为由其他创作者创建或认可的内容，或在网站上冒充其他创作者的内容。</h4>
        <h2>知识产权</h2>
        <p>通过上传文件或其他内容或进行评论，您向我们声明并保证 （1） 这样做不会违反或侵犯任何其他人的权利;（2） 您创建了您要上传的文件或其他内容，或以其他方式拥有足够的知识产权来上传符合这些条款的材料。对于您上传到我们网站公共部分的任何文件或内容，您授予 Civitai 非排他性、免版税、永久、不可撤销的全球许可（包括再许可和转让权），以使用、在线和在任何当前或未来的媒体上显示、创建衍生作品、允许下载和/或分发任何此类文件或内容。如果您从我们网站的公共部分删除任何此类文件或内容，您根据前一句授予 RVC 的许可将自动终止，但不会撤销 RVC 已经复制和再许可或指定用于再许可的任何文件或内容。此外，当然，即使在您删除后，您发布到我们网站公共部分的任何内容也可能被公众根据以下段落使用。</p>
        <h3>RVC 内容的使用</h3>
        <p>通过从 RVC 下载文件或音频或复制其他用户生成内容 （UGC），您同意您不对其主张任何权利。以下条件适用于您对UGC的使用：</p>
        <p>1、个人、非商业用途：除了内容创建者授予的或本条款允许的任何其他特定权利外，您还可以将 UGC 用于个人、非商业目的。</p>
        <p>2、合理使用：您可以将 UGC 用于任何符合版权法规定的合理使用内容，例如新闻（新闻、评论、批评等），前提是您在显示位置旁边添加属性（“Civitai”或“礼貌 Civitai”）。</p>
        <p>3、风险和保证：您使用 UGC 的风险由您自行承担。Civitai 不保证不侵权，您将赔偿 Civitai 并使其免受因您使用 UGC 而引起的任何版权侵权索赔。</p>
        <p>3、风险和保证：您使用 UGC 的风险由您自行承担。Civitai 不保证不侵权，您将赔偿 Civitai 并使其免受因您使用 UGC 而引起的任何版权侵权索赔</p>
      </div>
    </div>
  </div>
</template>

<style scoped>
.home{
  width:100%;
  height:100vh;
  background-color: rgb(66, 66, 68);
}
.contain{
  position: relative;
  overflow: scroll;
  left:9%;
  width:82%;
  height: 100vh;
  background-color:  rgb(66, 66, 68);
  box-shadow: 16px 16px 32px #363638,
  -16px -16px 32px #4e4e50;
}
.contain-text{
  position: relative;
  overflow: scroll;
  text-align: left;
  width:90%;
  height:90%;
  color: #e0e0e0;
}
h1{
  font-size: 30px;
}
h2{
  margin-top: 20px;
}
h3{
  margin-top: 15px;
}
h4{
  margin-top: 5px;
}
p{
  margin-top: 10px;
}
h4::before {
  content: '\2022';
  display: inline-block;
  width: 1em;
  margin-right: 0.5em;
}
</style>